; domain
(define (domain basic_logistics)
(:requirements :strips :typing)
    
    (:types 
        location locatable - object
        items cook - locatable
        ingredient pot - items
        ground counter - location
    )
    
    (:predicates
        (connected ?from ?to - ground)
        (at ?c - cook ?g - ground)
        (in ?i - ingredient ?p - pot)
        (on ?itm - items ?ctr - counter)
        (hold ?i - ingredient ?c - cook)
        (adjacent ?g - ground ?ctr - counter)
    )
    
    ;;================;;
    ;; cook actions ;;
    ;;================;;
    
    (:action walk
      :parameters (?c - cook ?from ?to - ground)
      :precondition (and
        ;; TODO: Add the preconditions here
        (connected ?from ?to)
        (at ?c ?from)
      )
      :effect (and
        ;; TODO: Add the effects here
        (at ?c ?to)
        (not (at ?c ?from))
      )
    )
    
    (:action pick_ingredient
      :parameters (?i - ingredient ?c - cook ?ctr - counter ?stand - ground)
      :precondition (and
        ;; TODO: Add the preconditions here
        (on ?i ?ctr)
        (adjacent ?stand ?ctr)
        (at ?c ?stand)
      )
      :effect (and
        ;; TODO: Add the effects here
        (hold ?i ?c)
      )
    )
    
    (:action drop_ingredient
      ;; TODO: Complete defining this action
      :parameters (?i - ingredient ?c - cook ?ctr - counter ?stand - ground ?p - pot)
      :precondition (and
        ;; TODO: Add the preconditions here
        (adjacent ?stand ?ctr)
        (at ?c ?stand)
        (hold ?i ?c)
        (on ?p ?ctr)
      )
      :effect (and
        ;; TODO: Add the effects here
        (in ?i ?p)
        (not (hold ?i ?c))
      )
    )
    
)

; problem
(define (problem problem_logistics)
(:domain basic_logistics)
(:requirements :strips :typing)

    (:objects 
        g1 g2 g3 g4 g5 g6 g7 - ground
        ctr1 ctr2 ctr3 ctr4 ctr5 - counter
        p1 - pot
        c1 c2 - cook
        ingred1 ingred2 ingred3 - ingredient
    )
    
    (:init
        ;; cooks is at g1 and g6, respectively
        (at c1 g1)
        (at c2 g6)
        
        ;; TODO: complete pot is on counter ctr1
        (on p1 ctr1)
        ;; TODO: complete ingredients are on counters ctr3, ctr4 and ctr5, respectively
        (on ingred1 ctr3)
        (on ingred2 ctr4)
        (on ingred3 ctr5)
        ;; TODO: complete all ground adjacent to counter (define as show in Figure 2)
        (adjacent g2 ctr1)
        (adjacent g5 ctr1)
        (adjacent g5 ctr3)
        (adjacent g7 ctr5)
        (adjacent g6 ctr4)
        (adjacent g3 ctr4)
        
        ;; TODO: complete all ground connections (define as show in Figure 2)
        (connected g1 g2)
        (connected g1 g3)
        (connected g2 g4)
        (connected g2 g1)
        (connected g3 g4)
        (connected g3 g1)
        (connected g4 g2)
        (connected g4 g3)
        (connected g4 g5)
        (connected g4 g6)
        (connected g5 g4)
        (connected g5 g7)
        (connected g6 g4)
        (connected g6 g7)
        (connected g7 g5)
        (connected g7 g6)
    )
    
    (:goal (and 
        ;; TODO: complete this section
        (at c1 g1)
        (at c2 g6)
        (in ingred1 p1)
        (in ingred2 p1)
        (in ingred3 p1)
    ))
)

; plan
1. (walk c1 g1 g2)
   deleted: (at c1 g1)
   added: (at c1 g2)
   goals met: 1 of 5
2. (walk c1 g2 g4)
   deleted: (at c1 g2)
   added: (at c1 g4)
   goals met: 1 of 5
3. (walk c1 g4 g5)
   deleted: (at c1 g4)
   added: (at c1 g5)
   goals met: 1 of 5
4. (pick_ingredient ingred1 c1 ctr3 g5)
   added: (hold ingred1 c1)
   goals met: 1 of 5
5. (drop_ingredient ingred1 c1 ctr1 g5 p1)
   deleted: (hold ingred1 c1)
   added: (in ingred1 p1)
   goals met: 2 of 5
6. (walk c1 g5 g7)
   deleted: (at c1 g5)
   added: (at c1 g7)
   goals met: 2 of 5
7. (pick_ingredient ingred3 c1 ctr5 g7)
   added: (hold ingred3 c1)
   goals met: 2 of 5
8. (walk c1 g7 g5)
   deleted: (at c1 g7)
   added: (at c1 g5)
   goals met: 2 of 5
9. (drop_ingredient ingred3 c1 ctr1 g5 p1)
   deleted: (hold ingred3 c1)
   added: (in ingred3 p1)
   goals met: 3 of 5
10. (walk c1 g5 g4)
   deleted: (at c1 g5)
   added: (at c1 g4)
   goals met: 3 of 5
11. (walk c1 g4 g3)
   deleted: (at c1 g4)
   added: (at c1 g3)
   goals met: 3 of 5
12. (pick_ingredient ingred2 c1 ctr4 g3)
   added: (hold ingred2 c1)
   goals met: 3 of 5
13. (walk c1 g3 g4)
   deleted: (at c1 g3)
   added: (at c1 g4)
   goals met: 3 of 5
14. (walk c1 g4 g2)
   deleted: (at c1 g4)
   added: (at c1 g2)
   goals met: 3 of 5
15. (drop_ingredient ingred2 c1 ctr1 g2 p1)
   deleted: (hold ingred2 c1)
   added: (in ingred2 p1)
   goals met: 4 of 5
16. (walk c1 g2 g1)
   deleted: (at c1 g2)
   added: (at c1 g1)
   goals met: 5 of 5
